000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000410 WORKING-STORAGE SECTION
000420 01  LINECOUNT PIC 99.
000430 01  DISPCOUNT PIC Z9.
000500 PROCEDURE DIVISION.
000600 00-MAIN.
000700     PERFORM SHOW-MESSAGE VARYING LINECOUNT FROM 1 BY 1 
000710         UNTIL LINECOUNT > 10.
000800     STOP RUN.
000900 SHOW-MESSAGE.
000910     MOVE LINECOUNT TO DISPCOUNT.
001000     DISPLAY "Hello World From COBOL, line ", DISPCOUNT.
